Revit 2027 API
BuiltInFailures.StairRampFailures.ArcRunRadiusTooSmall Property
 Can't create Run. Run radius is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArcRunRadiusTooSmall { get; }
Public Shared ReadOnly Property ArcRunRadiusTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArcRunRadiusTooSmall {
	FailureDefinitionId^ get ();
}
static member ArcRunRadiusTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace